{"config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["dense_6", 0, 0], ["dense_7", 0, 0], ["dense_8", 0, 0], ["dense_9", 0, 0], ["dense_10", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 28, 140, 1], "sparse": false, "input_dtype": "float32", "name": "input_2"}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dim_ordering": "tf", "trainable": true, "nb_row": 5, "b_regularizer": null, "name": "convolution2d_3", "activation": "relu", "nb_filter": 30, "activity_regularizer": null, "border_mode": "same", "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "name": "convolution2d_3", "inbound_nodes": [[["input_2", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2]}, "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_4", "activation": "relu", "nb_filter": 15, "activity_regularizer": null, "border_mode": "same", "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "name": "convolution2d_4", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "name": "maxpooling2d_4", "strides": [2, 2], "pool_size": [2, 2]}, "name": "maxpooling2d_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["flatten_2", 0, 0]]], "class_name": "Dropout"}, {"config": {"trainable": true, "input_dim": 3675, "bias": true, "b_regularizer": null, "name": "dense_6", "activation": "softmax", "activity_regularizer": null, "W_constraint": null, "output_dim": 11, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "name": "dense_6", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "input_dim": 3675, "bias": true, "b_regularizer": null, "name": "dense_7", "activation": "softmax", "activity_regularizer": null, "W_constraint": null, "output_dim": 11, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "name": "dense_7", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "input_dim": 3675, "bias": true, "b_regularizer": null, "name": "dense_8", "activation": "softmax", "activity_regularizer": null, "W_constraint": null, "output_dim": 11, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "name": "dense_8", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "input_dim": 3675, "bias": true, "b_regularizer": null, "name": "dense_9", "activation": "softmax", "activity_regularizer": null, "W_constraint": null, "output_dim": 11, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "name": "dense_9", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}, {"config": {"trainable": true, "input_dim": 3675, "bias": true, "b_regularizer": null, "name": "dense_10", "activation": "softmax", "activity_regularizer": null, "W_constraint": null, "output_dim": 11, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "name": "dense_10", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense"}], "name": "model_2"}, "keras_version": "1.2.2", "class_name": "Model"}