{"keras_version": "1.2.2", "config": {"layers": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 28, 140, 1], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "subsample": [1, 1], "nb_filter": 30, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_1", "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "subsample": [1, 1], "nb_filter": 30, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_2", "activation": "relu"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "subsample": [1, 1], "nb_filter": 15, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_3", "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "subsample": [1, 1], "nb_filter": 15, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_4", "activation": "relu"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 11, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "input_dim": 3675, "activation": "softmax"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 11, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "input_dim": 3675, "activation": "softmax"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 11, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "input_dim": 3675, "activation": "softmax"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 11, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "input_dim": 3675, "activation": "softmax"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_4", "class_name": "Dense"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 11, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_5", "input_dim": 3675, "activation": "softmax"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_5", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0], ["dense_5", 0, 0]]}, "class_name": "Model"}